"Please Donate" = "Por favor contribua";

"Donate!" = "Doar!";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "Foram necessárias inúmeras noites para desenvolver esta aplicação. Se gosta de utilizá-la, por favor considere fazer um donativo ao autor deste software. Estará a ajudar a tornar o Cyberduck ainda melhor!";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "Ao contribuir para o Cyberduck, receberá uma chave de donativo que desactiva este pedido.";

"Thank you for using Cyberduck!" = "Obrigado por usar o Cyberduck!";

"Later" = "Mais Tarde";

"Don't show again for this version." = "Não mostrar novamente para esta versão.";

"The payment can be made simply and safely using Paypal. You don't need to open an account." = "O pagamento pode ser feito de forma simples e segura usando o Paypal. Não é necessário que abra uma conta.";

"Donation Key" = "Chave de donativo";

